# 11.2 구조적 데이터 표시와 처리에 강한 pandas

라이브러리 기능, 목적 명확해   
numpy pandas 데이터를 분석

데이터 분석
하나하나의 값이 뭔지 알려줘야지 
1차원 series / 2차원 DataFrame

행값이 없을 때는
행값 열값 지정해서 

데이터

### 구조적 데이터 생성하기

Series를 활용한 데이터 생성

s = pd.Series(seq_data)

In [1]:
import pandas as pd

Series 생성하기   
세로축 라벨을 index, 입력한 시퀀스 데이터를 values라고 한다.

In [4]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

indexd와 values 분리해서 가져오기

In [5]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [75]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

혼합된 리스트 생성

In [213]:
s2 = pd.Series(['a','b','c',1,2,3]) #단, object로 처리
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

데이터가 없을 경우 Numpy를 import하여 데이터 없음 표기 가능

In [12]:
import numpy as np
s3 = pd.Series([np.nan,10,30]) #nan = not a number
s3

0     NaN
1    10.0
2    30.0
dtype: float64

인자로 index 추가   
s = pd.Series(seq_data, index = index_seq)   
seq_data와 index_seq의 개수가 일치해야 함

In [13]:
index_date = ['2023-01-01','2023-01-02','2023-01-03','2023-01-04']
s4 =pd.Series([200,195,np.nan,205], index = index_date)
s4

2023-01-01    200.0
2023-01-02    195.0
2023-01-03      NaN
2023-01-04    205.0
dtype: float64

딕셔너리를 이용하면 데이터와 index를 함께 입력 가능

In [14]:
s5 = pd.Series({'국어':100, '영어':95, '수학':90})
s5

국어    100
영어     95
수학     90
dtype: int64

#### 날짜 자동 생성: date_range

In [15]:
import pandas as pd

pd.date_range(start='2019-01-01', end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [19]:
pd.date_range(start = '2022.12.19', end = '2023/01/03')

DatetimeIndex(['2022-12-19', '2022-12-20', '2022-12-21', '2022-12-22',
               '2022-12-23', '2022-12-24', '2022-12-25', '2022-12-26',
               '2022-12-27', '2022-12-28', '2022-12-29', '2022-12-30',
               '2022-12-31', '2023-01-01', '2023-01-02', '2023-01-03'],
              dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range(start='2019-01-01', end='2019.01.07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

periods 사용하기

In [24]:
pd.date_range(start ='2019/01/01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

freq 사용하기

In [26]:
pd.date_range(start = '2019-01-01', periods =7, freq = '2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07',
               '2019-01-09', '2019-01-11', '2019-01-13'],
              dtype='datetime64[ns]', freq='2D')

In [27]:
pd.date_range(start = '2019-01-01', periods =7, freq = '2M')

DatetimeIndex(['2019-01-31', '2019-03-31', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-30', '2020-01-31'],
              dtype='datetime64[ns]', freq='2M')

요일 시작 기준 일주일 주기 freq='W', freq='W-MON

In [29]:
pd.date_range(start='2023-01-01', periods = 4, freq = 'W-mon')

DatetimeIndex(['2023-01-02', '2023-01-09', '2023-01-16', '2023-01-23'], dtype='datetime64[ns]', freq='W-MON')

업무 월말 날짜 기준 주기 freq = 'BM', freq = '2BM'

In [32]:
pd.date_range(start ='2023-01-01', periods = 12, freq = 'BM')

DatetimeIndex(['2023-01-31', '2023-02-28', '2023-03-31', '2023-04-28',
               '2023-05-31', '2023-06-30', '2023-07-31', '2023-08-31',
               '2023-09-29', '2023-10-31', '2023-11-30', '2023-12-29'],
              dtype='datetime64[ns]', freq='BM')

분기 시작 기준 날짜 주기 freq='QS', freq = '2QS'

In [33]:
pd.date_range(start= '2023-01-01', periods = 4, freq ='QS')

DatetimeIndex(['2023-01-01', '2023-04-01', '2023-07-01', '2023-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

연도 기준 날짜 주기 freq ='AS', freq='2AS'

In [34]:
pd.date_range(start='2023-01-01', periods = 3, freq = 'AS')

DatetimeIndex(['2023-01-01', '2024-01-01', '2025-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

시간 기준 주기 freq = 'H'

In [43]:
pd.date_range(start ='2023-01-03 09:00', periods = 10, freq='H') #시간 입력해야 해

DatetimeIndex(['2023-01-03 09:00:00', '2023-01-03 10:00:00',
               '2023-01-03 11:00:00', '2023-01-03 12:00:00',
               '2023-01-03 13:00:00', '2023-01-03 14:00:00',
               '2023-01-03 15:00:00', '2023-01-03 16:00:00',
               '2023-01-03 17:00:00', '2023-01-03 18:00:00'],
              dtype='datetime64[ns]', freq='H')

업무 시간 기준 주기

In [39]:
pd.date_range(start ='2023-01-03 07:00', periods = 10, freq='BH')

DatetimeIndex(['2023-01-03 09:00:00', '2023-01-03 10:00:00',
               '2023-01-03 11:00:00', '2023-01-03 12:00:00',
               '2023-01-03 13:00:00', '2023-01-03 14:00:00',
               '2023-01-03 15:00:00', '2023-01-03 16:00:00',
               '2023-01-04 09:00:00', '2023-01-04 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

30분 단위로 시간을 생성하기

In [47]:
pd.date_range(start ='2023-01-01 09:00', periods = 60, freq = '30min')

DatetimeIndex(['2023-01-01 09:00:00', '2023-01-01 09:30:00',
               '2023-01-01 10:00:00', '2023-01-01 10:30:00',
               '2023-01-01 11:00:00', '2023-01-01 11:30:00',
               '2023-01-01 12:00:00', '2023-01-01 12:30:00',
               '2023-01-01 13:00:00', '2023-01-01 13:30:00',
               '2023-01-01 14:00:00', '2023-01-01 14:30:00',
               '2023-01-01 15:00:00', '2023-01-01 15:30:00',
               '2023-01-01 16:00:00', '2023-01-01 16:30:00',
               '2023-01-01 17:00:00', '2023-01-01 17:30:00',
               '2023-01-01 18:00:00', '2023-01-01 18:30:00',
               '2023-01-01 19:00:00', '2023-01-01 19:30:00',
               '2023-01-01 20:00:00', '2023-01-01 20:30:00',
               '2023-01-01 21:00:00', '2023-01-01 21:30:00',
               '2023-01-01 22:00:00', '2023-01-01 22:30:00',
               '2023-01-01 23:00:00', '2023-01-01 23:30:00',
               '2023-01-02 00:00:00', '2023-01-02 00:30:00',
               '2023-01-02 01:00:00', '2023-01-02 01:30:00',
               '2023-01-02 02:00:00', '2023-01-02 02:30:00',
               '2023-01-02 03:00:00', '2023-01-02 03:30:00',
               '2023-01-02 04:00:00', '2023-01-02 04:30:00',
               '2023-01-02 05:00:00', '2023-01-02 05:30:00',
               '2023-01-02 06:00:00', '2023-01-02 06:30:00',
               '2023-01-02 07:00:00', '2023-01-02 07:30:00',
               '2023-01-02 08:00:00', '2023-01-02 08:30:00',
               '2023-01-02 09:00:00', '2023-01-02 09:30:00',
               '2023-01-02 10:00:00', '2023-01-02 10:30:00',
               '2023-01-02 11:00:00', '2023-01-02 11:30:00',
               '2023-01-02 12:00:00', '2023-01-02 12:30:00',
               '2023-01-02 13:00:00', '2023-01-02 13:30:00',
               '2023-01-02 14:00:00', '2023-01-02 14:30:00'],
              dtype='datetime64[ns]', freq='30T')

T

초 단위로 생성하기

In [54]:
pd.date_range(start = '2023-01-03 10:00:00', periods = 6, freq='10S')

DatetimeIndex(['2023-01-03 10:00:00', '2023-01-03 10:00:10',
               '2023-01-03 10:00:20', '2023-01-03 10:00:30',
               '2023-01-03 10:00:40', '2023-01-03 10:00:50'],
              dtype='datetime64[ns]', freq='10S')

pandas 왜 시간 관련 
index값, value값 필요해
시간을 인덱스 값으로 쓰고 싶을 수 있어

date_range를 이용해 Series의 index를 지정하기

In [55]:
index_date = pd.date_range(start ='2022-01-01', periods = 4, freq = 'QS')
pd.Series([51,62,55,49], index = index_date)

2022-01-01    51
2022-04-01    62
2022-07-01    55
2022-10-01    49
Freq: QS-JAN, dtype: int64

### DataFrame을 활용한 데이터 생성

2차원 데이터를 위해서 DataFrame을 사용   
df = pd.DateFrame(data[,index = index_data, columns = columns_data])

In [56]:
import pandas as pd
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Numpy의 배열 데이터를 활용한 DataFrame 생성

index와 columns 지정

In [63]:
import numpy as py
import pandas as pd

data = np.array([[1,2,3], [4,5,6], [7,8,9],[10,11,12]])
index_date = pd.date_range('2022-09-01', periods = 4)
columns_list = ['A','B','C']
pd.DataFrame(data, index = index_date, columns = columns_list)

             A   B   C
2022-09-01   1   2   3
2022-09-02   4   5   6
2022-09-03   7   8   9
2022-09-04  10  11  12

딕셔너리 타입으로 2차원 데이터를 입력했을 경우

In [66]:
table_data = {'연도':[2015,2016,2016,2017,2017], '지사':['한국','한국','미국','한국','미국'], '고객 수':[200,250,450,300,500]}
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

In [67]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

지정된 순서대로 출력하기

In [70]:
df = pd.DataFrame(table_data, columns=['연도', '고객 수', '지사'])
df

     연도  고객 수  지사
0  2015   200  한국
1  2016   250  한국
2  2016   450  미국
3  2017   300  한국
4  2017   500  미국

DataFrame 데이터에서 index, columns, values를 각각 구하기

In [71]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [72]:
df.columns

Index(['연도', '고객 수', '지사'], dtype='object')

In [73]:
df.values

array([[2015, 200, '한국'],
       [2016, 250, '한국'],
       [2016, 450, '미국'],
       [2017, 300, '한국'],
       [2017, 500, '미국']], dtype=object)

### 데이터 연산

pandas의 Series()와 DataFrame()에서 생성한 데이터끼리는 사칙연산을 할 수 있다

In [77]:
s1= pd.Series([1,2,3,4,5])
s2 =pd.Series([10,20,30,40,50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [78]:
s2 - s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [79]:
s2/s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [80]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

데이터끼리 크기가 달라도 연산이 가능하나 연산 할 수 없는 부분을 nan으로 처리됨

In [82]:
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10,20,30,40,50])
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [83]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [84]:
s3*s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [85]:
s4 / s3

0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

DataFrame끼리 사칙연산

In [88]:
table_data1 ={'A': [1,2,3,4,5], 'B':[10,20,30,40,50], 'C':[100,200,300,400,500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [89]:
table_data2 = {'A':[6,7,8], 'B':[60,70,80],'C':[600,700,800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [90]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [91]:
df1 * df2

      A       B         C
0   6.0   600.0   60000.0
1  14.0  1400.0  140000.0
2  24.0  2400.0  240000.0
3   NaN     NaN       NaN
4   NaN     NaN       NaN

In [92]:
df2 / df1

          A         B         C
0  6.000000  6.000000  6.000000
1  3.500000  3.500000  3.500000
2  2.666667  2.666667  2.666667
3       NaN       NaN       NaN
4       NaN       NaN       NaN

데이터의 총합, 평균, 표준 편차 등을 쉽게 구할 수 있다

In [96]:
table_data3 = {'봄': [256.5, 264.3 ,215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 281.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름','가을','겨울']
index_list = ['2018', '2019', '2020', '2021', '2022']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2018  256.5  770.6  363.5  139.3
2019  264.3  567.5  231.2   59.9
2020  215.9  599.8  293.1   76.9
2021  223.2  387.1  247.7  109.1
2022  312.8  446.2  281.6  108.1

평균과 표준편차

In [97]:
df3.mean()

봄     254.54
여름    554.24
가을    283.42
겨울     98.66
dtype: float64

In [98]:
df3.std()

봄      38.628267
여름    148.888895
가을     51.265651
겨울     30.925523
dtype: float64

In [99]:
df3.sum()

봄     1272.7
여름    2771.2
가을    1417.1
겨울     493.3
dtype: float64

In [100]:
df3.var()

봄      1492.143
여름    22167.903
가을     2628.167
겨울      956.388
dtype: float64

In [96]:
table_data3 = {'봄': [256.5, 264.3 ,215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 281.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름','가을','겨울']
index_list = ['2018', '2019', '2020', '2021', '2022']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2018  256.5  770.6  363.5  139.3
2019  264.3  567.5  231.2   59.9
2020  215.9  599.8  293.1   76.9
2021  223.2  387.1  247.7  109.1
2022  312.8  446.2  281.6  108.1

In [97]:
df3.mean()

봄     254.54
여름    554.24
가을    283.42
겨울     98.66
dtype: float64

axis = 0이면 열별로 1이면 행별로 연산을 수행() (설정하지 않으면 0)

In [106]:
df3.mean(axis=1)

2018    382.475
2019    280.725
2020    296.425
2021    241.775
2022    287.175
dtype: float64

describe()를 사용하면

In [109]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  283.420000   98.660000
std     38.628267  148.888895   51.265651   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  281.600000  108.100000
75%    264.300000  599.800000  293.100000  109.100000
max    312.800000  770.600000  363.500000  139.300000

In [101]:
commands = [[2, 5, 3], [4, 4, 1], [1, 7, 3]]

In [105]:
commands[0:2]

[[2, 5, 3], [4, 4, 1]]

In [114]:
commands[0][0]

2

### 데이터를 원하는 대로 선택하기

In [110]:
import pandas as pd
import numpy as np

KTX_data = {'경부선 KTX': [39060, 39896, 422005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6813, 8626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan, np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [115]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [119]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [117]:
df_KTX.values

array([[3.90600e+04, 7.31300e+03, 3.62700e+03, 3.09000e+02,         nan],
       [3.98960e+04, 6.96700e+03, 4.16800e+03, 1.77100e+03,         nan],
       [4.22005e+05, 6.81300e+03, 4.08800e+03, 1.95400e+03,         nan],
       [4.36210e+04, 8.62600e+03, 4.42400e+03, 2.24400e+03,         nan],
       [4.17020e+04, 8.67500e+03, 4.60600e+03, 3.14600e+03, 2.39500e+03],
       [4.12660e+04, 1.06220e+04, 4.98400e+03, 3.94500e+03, 3.78600e+03],
       [3.24270e+04, 9.22800e+03, 5.57000e+03, 5.76600e+03, 6.66700e+03]])

head / tail

In [122]:
df_KTX.head() #앞에서부터 5개

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [123]:
df_KTX.tail() #뒤에서부터 5개

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

지정한 수만큼 출력하기

In [124]:
df_KTX.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013   422005     6813     4088     1954      NaN

In [125]:
df_KTX.tail(2)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

DataFrame에서 연속된 구간의 행 데이터를 선택하기   
DataFrame_data[행_시작:행_끝]

In [126]:
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [127]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

index를 지정하기
DataFrame_data_loc[index_name]

In [131]:
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

구간을 지정해서 출력하기

In [130]:
df_KTX.loc['2013':'2016'] #location 까지 (미만x)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

하나의 열 데이터를 출력하기

In [135]:
df_KTX['경부선 KTX']

2011     39060
2012     39896
2013    422005
2014     43621
2015     41702
2016     41266
2017     32427
Name: 경부선 KTX, dtype: int64

하나의 열 데이터에서 index 범위 지정하기

DataFrame_data[column_name][start_index_name :  end_index_name]   
DataFrame_data[column_name][start_index_pos:end_index_pos]

In [133]:
df_KTX['경부선 KTX']['2012':'2014']

2012     39896
2013    422005
2014     43621
Name: 경부선 KTX, dtype: int64

In [134]:
df_KTX['경부선 KTX'][2:5]

2013    422005
2014     43621
2015     41702
Name: 경부선 KTX, dtype: int64

DataFrame 중 하나의 원소만 선택하기

DataFrame_data.loc[index_name

In [137]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [136]:
df_KTX.loc['2016', '호남선 KTX']

10622

In [138]:
df_KTX['호남선 KTX']['2016']

10622

In [139]:
df_KTX['호남선 KTX'][5]

10622

In [140]:
df_KTX['호남선 KTX'].loc['2016']

10622

행과 열을 바꾸기

In [143]:
df_KTX.T #저장이 된 건 아니야 (출력만)

            2011     2012      2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  422005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0    6813.0   8626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0    4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0    1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN       NaN      NaN   2395.0   3786.0   6667.0

In [142]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013   422005     6813     4088     1954      NaN
2014    43621     8626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

열의 순서을 지정하여 변경하기

In [144]:
df_KTX[['동해선 KTX', '전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']]

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6813   422005
2014      NaN     2244     4424     8626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

### 데이터 통합하기

#### 세로 방향으로 통합하기

DataFrame_data1.append(DataFrame_data2[,ignore_index=True]

In [146]:
import pandas as pd

df1 = pd.DataFrame({'class1' : [95,92,98,100],
                    'class2' : [91,93,97,99]})
df1

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99

In [147]:
df2 = pd.DataFrame({'class1': [87, 89],
                    'class2': [85,90]})
df2

   class1  class2
0      87      85
1      89      90

In [148]:
df1.append(df2)

C:\Users\Playdata\AppData\Local\Temp\ipykernel_4324\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [149]:
pd.concat([df1, df2])

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

index 순차적으로 연결시키기

In [150]:
df1.append(df2, ignore_index = True)

C:\Users\Playdata\AppData\Local\Temp\ipykernel_4324\2363792934.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2, ignore_index = True)

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [151]:
pd.concat([df1, df2], ignore_index =True)

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

columns가 같지 않은 데이터를 연결할 경우

In [153]:
df3 =pd.DataFrame({'class1': [96,83]})
df3

   class1
0      96
1      83

In [156]:
df2.append(df3, ignore_index = True)

C:\Users\Playdata\AppData\Local\Temp\ipykernel_4324\32609193.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df3, ignore_index = True)

   class1  class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

가로 방향으로 통합하기

DataFrame

In [164]:
df4 = pd.DataFrame({'class3': [93,91,95,98]})
df4

   class3
0      93
1      91
2      95
3      98

In [165]:
df1.join(df4)

   class1  class2  class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

index의 라벨을 지정한 경우에도 index가 맞다면 join 가능

In [174]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'class1': [95, 92, 98, 100],
                     'class2': [91, 93, 97, 99]})
df4a = pd.DataFrame({'class3': [93, 91, 95, 98]})
                    
df1a.join(df4a)

   class1  class2  class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

크기가 다른 경우

In [176]:
df5 = pd.DataFrame({'class4': [82,92]})
df5

   class4
0      82
1      92

In [177]:
df1.join(df5)

   class1  class2  class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

특정 열을 기준으로 통합하기

두 개의 데이터에 공통된 열(key)이 있다면 이 열의 기주능로 통합가능
DataFrame_left_data.merge(DataFrame_rig

In [179]:
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [180]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [100, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  100   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [181]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  100   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

일부만 공통 된 값을 갖는 경우

DataFrame_left_data.merge(DataFrame_right_data, how = merge_method, on = key_label)    
on = 통합할 인자 입력 (입력하지 않으면 공통된 열 자동설정)   
how = 지정된 열(key)을 기준으로 통합방법(merge_method)지정

In [182]:
df_left = pd.DataFrame({'key':['A','B','c'], 'left': [1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   c     3

In [183]:
df_right = pd.DataFrame({'key': ['A','B','D'], 'right': [4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

| how 선택인자 | 설명 |
|:-:|:-|
| left | 왼쪽 데이터는 모두 선택하고 지정된 열에 값이 있는 오른쪽 데이터를 선택|
| right | 오른쪽 데이터는 모두 선택하고 지정된 열에 값이 있는 왼쪽 데이터를 선택|
| outer | 지정된 열을 기준으로 왼쪽과 오른쪽 데이터를 모두 선택|
| inner | 지정된 열을 기준으로 왼쪽과 오른쪽 데이터 중 공통 항목만 선택(기본값)|

In [186]:
df_left.merge(df_right, how='left', on ='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   c     3    NaN

In [188]:
df_left.merge(df_right, how='right', on ='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [189]:
df_left.merge(df_right, how='outer', on ='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   c   3.0    NaN
3   D   NaN    6.0

In [190]:
df_left.merge(df_right, how='inner', on ='key')

  key  left  right
0   A     1      4
1   B     2      5

In [191]:
a = [1,2,3]
a[::-1]

[3, 2, 1]

### 데이터 파일을 읽고 쓰기

#### 표 형식의 데이터 파일을 읽기

DataFrame_data = pd.read_csv(file_name [,option])

In [192]:
%%writefile C:\myPyCode\data\sea_rain1.csv
연도, 동해,남해, 서해, 전체
1996, 17.4629, 17.2288, 14.436, 15.9067
1997, 17.4116, 17.4092, 14.8248, 16.1526
1998, 17.5944, 18.011, 15.2512, 16.6044
1999, 18.1495, 18.3175, 14.8979, 16.6284
2000, 17.9288, 18.1766, 15.0504, 16.6178

Writing C:\myPyCode\data\sea_rain1.csv

In [193]:
import pandas as pd

pd.read_csv('C:/myPyCode/data/sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [194]:
pd.read_csv('C:/myPyCode/data/sea_rain1_from_notepad.csv', encoding = "UTF-8")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

cp949?
csv 유니코드

필드를 공백으로 저장하기

메모장 어디서부터 어디까지 잘라야 하는지

In [202]:
%%writefile C:\myPyCode\data\sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Overwriting C:\myPyCode\data\sea_rain1_space.txt

In [203]:
pd.read_csv('C:/myPyCode/data/sea_rain1_space.txt', sep=" ")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

자동으로 설정된 index가 아닌 특정 열을 지정하고 싶을 때

In [204]:
pd.read_csv('C:/myPyCode/data/sea_rain1.csv', index_col="연도")

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

표 형식의 데이터를 파일로 쓰기

In [205]:
df_WH = pd.DataFrame({'Weight': [62,67,55,74],
                      'Height': [165, 177, 160,180]},
                     index = ['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

체질량 지수 구하기

In [207]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

새로운 열 추가   
df['column_name']=column_data

In [208]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

Data_Frame_data.to_csv(file_name[,options])

In [214]:
df_WH.to_csv('C:/myPyCode/data/save_DataFrame.csv') #다른이름으로 저장해야

저장된 파일 불러오기

In [210]:
!type C:\myPyCode\data\save_DataFrame.csv

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [215]:
df_pr = pd.DataFrame({'판매가격': [2000, 3000, 5000, 10000],
                      '판매량': [32, 53, 40, 25]},
                      index = ['P001','P002','P003','P004'])
df_pr.index.name = 'User'
df_pr

       판매가격  판매량
User
P001   2000   32
P002   3000   53
P003   5000   40
P004  10000   25

필드는 공백 문자 인코딩은 'cp94'로 저장 (텍스트 파일에서 주로 쓰는 인코딩 방식)

In [218]:
file_name = 'C:\myPyCode/data/save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep = " ", encoding = 'cp949')

In [219]:
!type C:\myPyCode\data\save_DataFrame_cp949.txt

User 판매가격 판매량
P001 2000 32
P002 3000 53
P003 5000 40
P004 10000 25